УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_УведомленияЛентаПользователя/КонтурЗакупки_УведомленияЛентаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЗакупки_УведомленияЛентаПользователя</name>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПрочтения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>НазваниеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.КонтурЗакупки/src/InformationRegisters/КонтурЗакупки_УведомленияЛентаПользователя/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Получить таблицу уведомлений пользователя.
// 
// Параметры: ПараметрЗапуска - Строка - Параметр запуска
//  НазваниеПроекта - Строка - Название проекта
//  ВерсияПроекта - Строка - Версия модуля
//  ИДКлиента - Строка - ИДКлиента
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить таблицу уведомлений пользователя:
// * Важность - Строка - 
// * Важное - Булево - 
// * Дата - Дата - 
// * Заголовок - Строка - 
// * Текст - Строка - 
// * Идентификатор - Строка - 
// * Прочитано - Булево - 
// * ДатаПрочтения - Дата - 
Функция ПолучитьТаблицуУведомленийПользователя(НазваниеПроекта, ВерсияПроекта, ИДКлиента) Экспорт

	МассивУведомлений = ПрочитатьУведомленияССервера(НазваниеПроекта, ВерсияПроекта, ИДКлиента);

	ТабУведомлений = ИнициализироватьТабУведомлений();

	Для Каждого Уведомление Из МассивУведомлений Цикл

		НовСтр = ТабУведомлений.Добавить();
		// Уведомление.content - это объект
		// задается публикатором
		// не формализован
		
		// Из Меркурия Уведомление.content.description - Сообщение
		// Из Меркурия Уведомление.content.title - заголовок
		Если Не Уведомление["content"]["description"] = Неопределено Тогда

			Текст = Уведомление["content"]["description"];
			Если СтрНайти(ВРег(Текст), "<HTML>") = 0 Тогда
				Текст = "<HTML><BODY>" + Текст + "</BODY></HTML>";
			КонецЕсли;
		КонецЕсли;
		Если Не Уведомление["content"]["title"] = Неопределено Тогда
			НовСтр.Заголовок = Уведомление["content"]["title"];
		КонецЕсли;

		НовСтр.Важность = Уведомление["priority"];
		НовСтр.Важное = Уведомление["priority"] = "high";
		НовСтр.Дата = ТекущаяДатаСеанса();
		НовСтр.Текст = Текст;
		НовСтр.Идентификатор = Уведомление["id"];

	КонецЦикла;

	Возврат ТабУведомлений;

КонецФункции

// Информация по уведомлениям.
// 
// Параметры: ПараметрЗапуска - Строка - Параметр запуска
//  НазваниеПроекта - Строка - Название проекта
//  ВерсияПроекта - Строка - Версия модуля
//  ИДКлиента - Строка - ИДКлиента
//  УчитыватьИнтервалОтложенных - Булево - Учитывать интервал отложенных
//  ВернутьТаблицу - Булево - Вернуть таблицу
// 
// Возвращаемое значение:
//  Структура - Информация по уведомлениям:
// * ИнтервалОжиданияМинут - Число - 
// * ТабУведомлений - ТаблицаЗначений, Неопределено - 
// * ВсегоУведомлений - Число - 
// * ЕстьНепрочитанные - Булево - 
// * ИдентификаторВажногоНепрочитанного - Строка - 
Функция ИнформацияПоУведомлениям(НазваниеПроекта, ВерсияПроекта, ИДКлиента, УчитыватьИнтервалОтложенных,
	ВернутьТаблицу = Ложь) Экспорт

	ИнтервалОжиданияМинут = 0;

	Если УчитыватьИнтервалОтложенных Тогда
		ИнтервалОжиданияМинут = КонтурЗакупки_УведомленияОбщегоНазначенияСервер.ИнтервалОжиданияОтложенныхВМинутах();
	КонецЕсли;

	ТабУведомлений = ПолучитьТаблицуУведомленийПользователя(НазваниеПроекта, ВерсияПроекта, ИДКлиента);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таб.Идентификатор КАК Идентификатор,
	|	Таб.Важность КАК Важность,
	|	Таб.Важное КАК Важное,
	|	Таб.Дата КАК Дата,
	|	Таб.Заголовок КАК Заголовок,
	|	Таб.Текст КАК Текст,
	|	Таб.Прочитано КАК Прочитано,
	|	Таб.ДатаПрочтения КАК ДатаПрочтения
	|ПОМЕСТИТЬ втТабУведомлений
	|ИЗ
	|	&ТабУведомлений КАК Таб
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТабУведомлений.Идентификатор КАК Идентификатор,
	|	втТабУведомлений.Важность КАК Важность,
	|	втТабУведомлений.Важное КАК Важное,
	|	втТабУведомлений.Дата КАК Дата,
	|	втТабУведомлений.Заголовок КАК Заголовок,
	|	втТабУведомлений.Текст КАК Текст,
	|	ЕСТЬNULL(ЛентаПользователя.Прочитано, ЛОЖЬ) КАК Прочитано,
	|	ЕСТЬNULL(ЛентаПользователя.ДатаПрочтения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПрочтения,
	|	РАЗНОСТЬДАТ(ЕСТЬNULL(ЛентаПользователя.ДатаПрочтения, ДАТАВРЕМЯ(2020, 1, 1)), &ТекущаяДата,
	|		СЕКУНДА) >= &ОтложитьСекунд КАК Просрочено
	|ИЗ
	|	втТабУведомлений КАК втТабУведомлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЗакупки_УведомленияЛентаПользователя КАК ЛентаПользователя
	|		ПО (ЛентаПользователя.Идентификатор = втТабУведомлений.Идентификатор
	|		И ЛентаПользователя.Пользователь = &ТекущийПользователь
	|		И ЛентаПользователя.НазваниеПроекта = &НазваниеПроекта)";

	Запрос.УстановитьПараметр("ТабУведомлений", ТабУведомлений);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТекущийПользователь",
		КонтурЗакупки_УведомленияОбщегоНазначенияСервер.ТекущийПользователь());
	Запрос.УстановитьПараметр("ОтложитьСекунд", ИнтервалОжиданияМинут * 60);
	Запрос.УстановитьПараметр("НазваниеПроекта", НазваниеПроекта);

	ТабУведомлений = Запрос.Выполнить().Выгрузить();
	СтруктураНепрочитанные = Новый Структура("Прочитано, Просрочено", Ложь, Истина);
	ЕстьНепрочитанные = ТабУведомлений.НайтиСтроки(СтруктураНепрочитанные).Количество() > 0;

	ИдентификаторВажногоНепрочитанного = "";
	Если ЕстьНепрочитанные Тогда
		СтруктураВажныеНепрочитанные = Новый Структура("Прочитано, Просрочено, Важное", Ложь, Истина, Истина);
		ВажныеНепрочитанные = ТабУведомлений.НайтиСтроки(СтруктураВажныеНепрочитанные);
		Если ВажныеНепрочитанные.Количество() > 0 Тогда
			ИдентификаторВажногоНепрочитанного = ВажныеНепрочитанные[0].Идентификатор;
		КонецЕсли;
	КонецЕсли;

	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("ИнтервалОжиданияМинут", ИнтервалОжиданияМинут);
	РезультатФункции.Вставить("ТабУведомлений", ?(ВернутьТаблицу, ТабУведомлений, Неопределено));
	РезультатФункции.Вставить("ВсегоУведомлений", ТабУведомлений.Количество());
	РезультатФункции.Вставить("ЕстьНепрочитанные", ЕстьНепрочитанные);
	РезультатФункции.Вставить("ИдентификаторВажногоНепрочитанного", ИдентификаторВажногоНепрочитанного);

	Возврат РезультатФункции;
КонецФункции

// Отложить прочтение важных.
// 
// Параметры:
//  НазваниеПроекта - Строка - Название проекта
//  МассивИдентификаторов - Массив из Строка - Массив идентификаторов
Процедура ОтложитьПрочтениеВажных(НазваниеПроекта, МассивИдентификаторов) Экспорт

	Попытка

		Для Каждого Идентификатор Из МассивИдентификаторов Цикл

			ОтметитьПрочитаннымОтложить(НазваниеПроекта, Идентификатор, Ложь);

		КонецЦикла;

	Исключение
		ТекстОшибки = НСтр("ru='Не удалось отложить прочтение важных уведомлений! %1'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", ОписаниеОшибки());
		КонтурЗакупки_УведомленияОбщегоНазначенияСервер.ОтправитьМетрикуОбОшибке(
		"ОтложитьПрочтениеВажных", ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

// Отметить прочитанным отложить.
// 
// Параметры:
//  НазваниеПроекта - Строка - Название проекта
//  Идентификатор - Строка - Идентификатор сообщения
//  ПрочитаноИлиОтложить - Булево - Прочитано или отложить
// 
// Возвращаемое значение:
//  Булево - Записалось в регистр
Функция ОтметитьПрочитаннымОтложить(НазваниеПроекта, Идентификатор, ПрочитаноИлиОтложить) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Результат = Истина;

	Попытка

		Запись = СоздатьМенеджерЗаписи();
		Запись.Идентификатор = Идентификатор;
		Запись.НазваниеПроекта = НазваниеПроекта;
		Запись.Пользователь = КонтурЗакупки_УведомленияОбщегоНазначенияСервер.ТекущийПользователь();
		Запись.Прочитано = ПрочитаноИлиОтложить;
		// в сочетании с Прочитано = Ложь это дата "предварительного" прочтения
		// (для расчета до какого времени отложить)
		Запись.ДатаПрочтения = ТекущаяДатаСеанса();
		Запись.Записать();

	Исключение

		Результат = Ложь;

	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции

// Прочитано.
// 
// Параметры:
//  Идентификатор - Строка - Идентификатор сообщения
// 
// Возвращаемое значение:
//  Булево -  Прочитано
Функция Прочитано(Идентификатор) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЛентаПользователя.Прочитано, ЛОЖЬ) КАК Прочитано
	|ИЗ
	|	РегистрСведений.КонтурЗакупки_УведомленияЛентаПользователя КАК ЛентаПользователя
	|ГДЕ
	|	ЛентаПользователя.Идентификатор = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();

	УстановитьПривилегированныйРежим(Ложь);

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Прочитано;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьТабУведомлений()

	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипДатаВремя = КонтурЗакупки_СлужебныеКлиентСервер.Новый_ОписаниеТиповДата(Истина);
	ТипДата = КонтурЗакупки_СлужебныеКлиентСервер.Новый_ОписаниеТиповДата(Ложь);
	ТипСтрока = КонтурЗакупки_СлужебныеКлиентСервер.Новый_ОписаниеТиповСтрока();
	ТипСтрока36 = КонтурЗакупки_СлужебныеКлиентСервер.Новый_ОписаниеТиповСтрока(36);

	ТабУведомлений = Новый ТаблицаЗначений;
	ТабУведомлений.Колонки.Добавить("Важность", ТипСтрока);
	ТабУведомлений.Колонки.Добавить("Важное", ТипБулево);
	ТабУведомлений.Колонки.Добавить("Дата", ТипДата);
	ТабУведомлений.Колонки.Добавить("Заголовок", ТипСтрока);
	ТабУведомлений.Колонки.Добавить("Текст", ТипСтрока);
	ТабУведомлений.Колонки.Добавить("Идентификатор", ТипСтрока36);
	ТабУведомлений.Колонки.Добавить("Прочитано", ТипБулево);
	ТабУведомлений.Колонки.Добавить("ДатаПрочтения", ТипДатаВремя);

	Возврат ТабУведомлений;

КонецФункции

Функция ПрочитатьУведомленияССервера(НазваниеПроекта, ВерсияПроекта, ИДКлиента)

	МассивУведомлений = Новый Массив;

	ПараметрыHTTPЗапроса = КонтурЗакупки_УведомленияОбщегоНазначенияСервер.ПараметрыЗапросаКСерверу(НазваниеПроекта);

	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("client_id", ИДКлиента);
	СтруктураТелаЗапроса.Вставить("version", ВерсияПроекта);

	ПараметрыHTTPЗапроса.ТелоЗапроса = КонтурЗакупки_СлужебныеВызовСервера.ПреобразоватьВJSON(
			СтруктураТелаЗапроса);

	Если Не ПараметрыHTTPЗапроса = Неопределено Тогда

		ПолныйПутьЗапроса = ПараметрыHTTPЗапроса["АдресСервера"] + ПараметрыHTTPЗапроса["СтрокаПодключения"];
		ОписаниеДействия = КонтурЗакупки_СтруктурыКлиентСервер.ПолучитьОписаниеДействия("notifications",
			"Получение оповещений", ПолныйПутьЗапроса, ПараметрыHTTPЗапроса["ТелоЗапроса"]);

		ОтключитьЛог = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ОтключитьЛог", Ложь);
		Если Не ОтключитьЛог Тогда
			КонтурЗакупки_СлужебныеВызовСервера.ДобавитьЛог(
				КонтурЗакупки_ДанныеПродуктаКлиентСерверПовтИсп.ПолучитьПрефиксПродукта(), ПолныйПутьЗапроса);
		КонецЕсли;
		РезультатHTTPЗапроса = КонтурЗакупки_httpКлиентСервер.ВыполнитьHTTPЗапросСМетрикой(ПараметрыHTTPЗапроса,
			ОписаниеДействия);
	КонецЕсли;
	Если Не РезультатHTTPЗапроса = Неопределено Тогда
		Если Не РезультатHTTPЗапроса["data"] = Неопределено И ТипЗнч(РезультатHTTPЗапроса["data"]) = Тип(
			"Соответствие") Тогда

			МассивУведомлений = РезультатHTTPЗапроса["data"]["notifications"];
		КонецЕсли;
	КонецЕсли;
	Возврат МассивУведомлений;

КонецФункции

#КонецОбласти
#КонецЕсли
